eisup_2019_docmng_integration/src/Documents/абс_РеклассификацияБюджетаДДС/абс_РеклассификацияБюджетаДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РеклассификацияБюджетаДДС</name>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.АктОбОказанииПроизводственныхУслуг</basedOn>
  <basedOn>Document.ТребованиеНакладная</basedOn>
  <basedOn>Document.ПередачаТоваров</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ПолучениеУслугПоПереработке</basedOn>
  <registerRecords>InformationRegister.абс_УстановкаЛимитовПоСтатьям</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <attributes>
    <name>Причина</name>
    <type>
      <types>CatalogRef.абс_ПричиныРеклассификацииБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПериодМесяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникПериодМесяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникСтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникКВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимитаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРекласификацииБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийРекласификацияБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеЗЗ</name>
    <comment>//для лимитов</comment>
    <type>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьЛимит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИнициатора</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДЭФ</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникСценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГород</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникГород</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>ИсточникПериодМесяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемникПериодМесяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ТаблицаСтатусовБПТТК/абс_ТаблицаСтатусовБПТТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ТаблицаСтатусовБПТТК</name>
  <resources>
    <name>РедактированиеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УсловиеПерехода</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаИзменениеСтатуса</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаНовыйСтатус</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБизнесПроцесса</name>
    <type>
      <types>EnumRef.абсВидыБизнесПроцессовТТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.абсСтатусыДоговоров</types>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
      <types>EnumRef.абсСтатусыСчетов</types>
      <types>EnumRef.абсСтатусыДоговоровПодряда</types>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
      <types>EnumRef.абсСтатусЗакупочногоЗаказа</types>
      <types>EnumRef.абсСтатусыАктовПриёмки</types>
      <types>EnumRef.абсСтатусыКонтрагентов</types>
      <types>EnumRef.абс_СтатусыРекласификацииБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусНовый</name>
    <type>
      <types>EnumRef.абсСтатусыДоговоров</types>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
      <types>EnumRef.абсСтатусыСчетов</types>
      <types>EnumRef.абсСтатусыДоговоровПодряда</types>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
      <types>EnumRef.абсСтатусЗакупочногоЗаказа</types>
      <types>EnumRef.абсСтатусыАктовПриёмки</types>
      <types>EnumRef.абсСтатусыКонтрагентов</types>
      <types>EnumRef.абс_СтатусыРекласификацииБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРекласификацииБюджета/абс_СтатусыРекласификацииБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРекласификацииБюджета</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФО</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Проведен</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОПриемник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФУПриемник</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБК</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОПриемникМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистом</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомИсточникМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомПриемникМКР</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_Бюджет/абс_Бюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_Бюджет</name>
  <enumValues>
    <name>абс_ДДС_ОРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_ДДС_САРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_ОРЕХ</name>
  </enumValues>
  <enumValues>
    <name>абс_САРЕХ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийРекласификацияБюджета/абс_ВидыОперацийРекласификацияБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийРекласификацияБюджета</name>
  <enumValues>
    <name>ПереносЛимитовМеждуАналитиками</name>
  </enumValues>
  <enumValues>
    <name>ПереносЛимитовМеждуПериодами</name>
  </enumValues>
  <enumValues>
    <name>ПереносФактаИсполненияБюджета</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсВидыБизнесПроцессовТТК/абсВидыБизнесПроцессовТТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсВидыБизнесПроцессовТТК</name>
  <enumValues>
    <name>СогласованиеКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоров</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗакупочныхЗаказов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервичныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявкиНаСклад</name>
  </enumValues>
  <enumValues>
    <name>РекласификацияБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиВПоддержку</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПланаБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаИзменениеРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатурныхГрупп</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСтатейЗатрат</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоровПодряда</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявокНаПроект</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплатуФилиализация</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РеклассификацияБюджетаДДС/Forms/ФормаДокументаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
		
		//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, Неопределено , ПараметрОбъектКопирования); 		
		Объект.Сценарий = Константы.абс_СценарийДляЗЗ.Получить();   		
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь"); 
        Объект.ИсточникПериодМесяц = НачалоМесяца(Объект.Дата);      		
		Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка;
		
	КонецЕсли;
	
	мСтатусДокумента = Объект.Статус;   
	ЗаполнитьСписокДоступныхСтатусов(); 	
	УстановитьРежимПросмотраДокумента();

КонецПроцедуры

&НаСервере
Функция СогласуетсяСотрудникомДК() Экспорт 
	
	врБюджет = Объект.Сценарий.абс_Бюджет;
	
	Возврат не Объект.Сценарий.Пустая()
				и (врБюджет = Перечисления.абс_Бюджет.абс_ДДС_ОРЕХ
					или врБюджет = Перечисления.абс_Бюджет.абс_ДДС_САРЕХ);

КонецФункции
				
&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов(СписокСтатусов = Неопределено)
	
	Если СписокСтатусов = Неопределено Тогда
		СписокСтатусов = Элементы.Статус.СписокВыбора;
	КонецЕсли;
	
	СписокСтатусов.Очистить();
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);

	Если ЗначениеЗаполнено(Объект.Статус) Тогда
		СписокСтатусов.Добавить(Объект.Статус);
	Иначе                                                                       
		Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка;
		мСтатусДокумента = Объект.Статус;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтатус = абс_БизнесПроцессы.ПолучитьСтатусРекласификацииПоРегистру(Объект.Ссылка);
	
	Если НЕ ЗначениеЗаполнено(ТекСтатус) Тогда
		
		СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка);
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка Тогда
		
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено) Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФО);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФО Тогда
		
		//АБС Коломиец 19255+
		ОрганизацияСогласование78 = Константы.абс_Согласование78БюджетаВключитьДля.Получить();
		//Сторчевой А.Н. 05.12.2016 7759851 {
		ttk_ЕдиноеЦФУ = ПараметрыСеанса.ttk_ЕдиноеЦФУ;
		ПерехНаЕдиноеЦФУ = (Объект.Дата >= '20170101' и ЗначениеЗаполнено(ttk_ЕдиноеЦФУ));
		// } Сторчевой А.Н. 05.12.2016 7759851
		Если (ОрганизацияСогласование78 = Справочники.Организации.ПустаяСсылка()
			И НЕ ПерехНаЕдиноеЦФУ //Сторчевой А.Н. 05.12.2016 7759851
			ИЛИ Объект.ИсточникОрганизация = ОрганизацияСогласование78 
			ИЛИ Объект.ПриемникОрганизация = ОрганизацияСогласование78)
			И ((ЗначениеЗаполнено(Объект.ИсточникСтатьяОборотов) И Объект.ИсточникСтатьяОборотов.абс_Согласование78)          
			ИЛИ (ЗначениеЗаполнено(Объект.ПриемникСтатьяОборотов) И Объект.ПриемникСтатьяОборотов.абс_Согласование78)) 
			И НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФО) = Неопределено Тогда
			Если Объект.ИсточникЦФО = Объект.ПриемникЦФО Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУ);
			Иначе
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФОПриемник);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);	
		//АБС Коломиец 19255-
		ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникДК) = Неопределено и СогласуетсяСотрудникомДК() Тогда
			Если Объект.ИсточникЦФО = Объект.ПриемникЦФО Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК);
			Иначе
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФОПриемник);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФО) = Неопределено и НЕ СогласуетсяСотрудникомДК() Тогда	
			Если Объект.ИсточникЦФО = Объект.ПриемникЦФО Тогда
				Если НЕ Объект.ПриемникСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост") Тогда
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ);
				Иначе
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ);
				КонецЕсли;
			Иначе
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФОПриемник);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		КонецЕсли;
		//АБС Коломиец 19255, 19806+	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФОПриемник Тогда
		
		ОрганизацияСогласование78 = Константы.абс_Согласование78БюджетаВключитьДля.Получить();
		Если (ОрганизацияСогласование78 = Справочники.Организации.ПустаяСсылка() 
			ИЛИ Объект.ИсточникОрганизация = ОрганизацияСогласование78 
			ИЛИ Объект.ПриемникОрганизация = ОрганизацияСогласование78)
			И ((ЗначениеЗаполнено(Объект.ИсточникСтатьяОборотов) И Объект.ИсточникСтатьяОборотов.абс_Согласование78)          
			ИЛИ (ЗначениеЗаполнено(Объект.ПриемникСтатьяОборотов) И Объект.ПриемникСтатьяОборотов.абс_Согласование78)) 
			И НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФО) = Неопределено Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);	
		ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникДК) = Неопределено и СогласуетсяСотрудникомДК() Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФО) = Неопределено и НЕ СогласуетсяСотрудникомДК() Тогда				
			Если НЕ Объект.ПриемникСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост") Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ);
			Иначе
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		КонецЕсли;
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУ Тогда
		
		Если Объект.ИсточникЦФУ = Объект.ПриемникЦФУ Тогда
			Если НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникДК) = Неопределено и СогласуетсяСотрудникомДК() Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
			ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФУ) = Неопределено и НЕ СогласуетсяСотрудникомДК() Тогда				
				Если НЕ Объект.ПриемникСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост") Тогда
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ);
				Иначе
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ);
				КонецЕсли;
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
			КонецЕсли;	
		Иначе
			Если НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФУ) = Неопределено Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУПриемник);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);			
			КонецЕсли;
		КонецЕсли;
			
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФУПриемник Тогда
		
		Если НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникДК) = Неопределено и СогласуетсяСотрудникомДК() Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		ИначеЕсли НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.РуководительЦФУ) = Неопределено и НЕ СогласуетсяСотрудникомДК() Тогда				
			Если НЕ Объект.ПриемникСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду("КВпоПост") Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ);
			Иначе
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
		КонецЕсли;			
		//АБС Коломиец 19255, 19806-
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК Тогда
		
		РолиКТТК = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Справочники.Организации.НайтиПоНаименованию("КТТК"));
					
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникДК) = Неопределено)
		 ИЛИ (Объект.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами  //АБС Коломиец 19806
		 И НЕ РолиКТТК.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено) Тогда   			
			
			//АБС Коломиец 19255+
			Если РеквизитФормыВЗначение("Объект").НеобходимоУтверждениеПВП() Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП);			
			Иначе //АБС Коломиец 19255-	
				Если РеквизитФормыВЗначение("Объект").БюджетныйКонтрольВкл() Тогда
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль);	
				Иначе	
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Проведен);
				КонецЕсли;
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
						
		КонецЕсли;
	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ Тогда
		
		РолиКТТК = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Справочники.Организации.НайтиПоНаименованию("КТТК"));
				
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеРекласификацииБюджетаДФМ) = Неопределено)
		 ИЛИ (Объект.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами  //АБС Коломиец 19806
		 И НЕ РолиКТТК.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено) Тогда   
			
			//АБС Коломиец 19255+
			Если РеквизитФормыВЗначение("Объект").НеобходимоУтверждениеПВП() Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП);			
			Иначе //АБС Коломиец 19255-				
				Если РеквизитФормыВЗначение("Объект").БюджетныйКонтрольВкл() Тогда
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль);	
				Иначе	
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Проведен);
				КонецЕсли;
			КонецЕсли; 			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
						
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ Тогда
		
		РолиКТТК = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Справочники.Организации.НайтиПоНаименованию("КТТК"));
					
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеРекласификацииБюджетаДЭИ) = Неопределено)
		 ИЛИ (Объект.ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами  //АБС Коломиец 19806
		 И НЕ РолиКТТК.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено) Тогда   			
			
			//АБС Коломиец 19255+
			Если РеквизитФормыВЗначение("Объект").НеобходимоУтверждениеПВП() Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП);			
			Иначе //АБС Коломиец 19255-				
				Если РеквизитФормыВЗначение("Объект").БюджетныйКонтрольВкл() Тогда
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль);	
				Иначе	
					СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Проведен);
				КонецЕсли;
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
						
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.Отказ Тогда
		
		Если (не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено)
				или (Объект.Ответственный = мТекущийПользователь 
						и (не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено)) Тогда 
						
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка);			
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение Тогда
		
		Если (не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено)
				или (Объект.Ответственный = мТекущийПользователь 
						и (не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено)) Тогда
			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен Тогда
		
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеРекласификацииБюджетаДФМ) = Неопределено) ИЛИ 
			 (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеРекласификацииБюджетаДЭИ) = Неопределено) ИЛИ 
			 (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено) Тогда
			 
			 СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);
			 
		 КонецЕсли;
		 
	//АБС Коломиец 19255+	
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеПВП Тогда
		
		РолиКТТК = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь, Справочники.Организации.НайтиПоНаименованию("КТТК"));
		
		Если (НЕ РолиКТТК.Найти(Справочники.РолиИсполнителей.ПервыйВицеПрезидент) = Неопределено) Тогда			
			
			Если РеквизитФормыВЗначение("Объект").БюджетныйКонтрольВкл() Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль);	
			Иначе	
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Проведен);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Уточнение);

		КонецЕсли;
	//АБС Коломиец 19255-
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль Тогда
		
		Если (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.ЗакрытиеОпераций_в_УУ) = Неопределено)
			или (НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено) Тогда
		СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Проведен);
		СписокСтатусов.Добавить(Перечисления.абс_СтатусыРекласификацииБюджета.Отказ);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура мСтатусДокументаПриИзменении(Элемент)
	
	Объект.Статус = мСтатусДокумента;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимПросмотраДокумента()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_ТаблицаСтатусовБПТТК.РедактированиеДокумента,
	                      |	абс_ТаблицаСтатусовБПТТК.ОтветственныйЗаИзменениеСтатуса
	                      |ИЗ
	                      |	РегистрСведений.абс_ТаблицаСтатусовБПТТК КАК абс_ТаблицаСтатусовБПТТК
	                      |ГДЕ
	                      |	абс_ТаблицаСтатусовБПТТК.ВидБизнесПроцесса = ЗНАЧЕНИЕ(Перечисление.абсВидыБизнесПроцессовТТК.РекласификацияБюджета)
	                      |	И абс_ТаблицаСтатусовБПТТК.Статус = &ТекСтатус");
						  
	Запрос.УстановитьПараметр("ТекСтатус", Объект.Статус);
	
	РазрешеноРедактирование 		= Ложь;
	РазрешеноМенятьСтатус 			= Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ мРолиПользователя.Найти(Выборка.ОтветственныйЗаИзменениеСтатуса) = Неопределено Тогда
			РазрешеноМенятьСтатус = Истина
		КонецЕсли;
		
		РазрешеноРедактирование = РазрешеноРедактирование ИЛИ Выборка.РедактированиеДокумента;
	КонецЦикла;
	
	
	// Добавили определение ответственных лиц по ответственным в подразделениях
	// поэтому не проверяем их по ролям пользователей.
	
	Если (Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка ИЛИ НЕ ЗначениеЗаполнено(Объект.Статус)) И
			(НЕ мРолиПользователя.Найти(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено)  Тогда
		
		РазрешеноМенятьСтатус = Истина;
	Иначе
		РазрешеноМенятьСтатус = Ложь;
	КонецЕсли;
	
	// Если есть задачи текущему пользователю, то ему разрешено изменить статус
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	                      |	абсЗадачаДоговораЗадачиПоИсполнителю.Ссылка
	                      |ИЗ
	                      |	Задача.абсЗадачаДоговора.ЗадачиПоИсполнителю(
	                      |			&ТекПользователь,
	                      |			ОбъектЗадачи = &РекласификацияБюджетаСсылка
	                      |				И Выполнена = ЛОЖЬ) КАК абсЗадачаДоговораЗадачиПоИсполнителю");
						  
	Запрос.УстановитьПараметр("ТекПользователь"			, мТекущийПользователь);
	Запрос.УстановитьПараметр("РекласификацияБюджетаСсылка"	, Объект.Ссылка);
	
	ВыборкаЗадач = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗадач.Следующий() Тогда
		
		РазрешеноМенятьСтатус = Истина;
		
	КонецЕсли;																				
	
	Элементы.Статус.Доступность = РазрешеноМенятьСтатус;	
	
	// Установим необходимый вид просмотра документа
	Если НЕ РазрешеноРедактирование Тогда
		
		ТолькоПросмотр = Истина;
		
//		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Записать.Доступность = РазрешеноМенятьСтатус;
		Элементы.КнопкаПровестиИЗакрыть.Доступность = РазрешеноМенятьСтатус;
		Элементы.КнопкаПровести.Доступность = РазрешеноМенятьСтатус;
		
	Иначе
		
		ЭтаФорма.ТолькоПросмотр = Ложь;
		
//		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Записать.Доступность = Истина;
		Элементы.КнопкаПровестиИЗакрыть.Доступность = Истина;
		Элементы.КнопкаПровести.Доступность = РазрешеноМенятьСтатус;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровестиИЗакрыть(Команда)
	
	Если Записать(Новый Структура("РежимЗаписи", ПолучитьРежимЗаписиДокумента())) Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПровести(Команда)
	
	Записать(Новый Структура("РежимЗаписи", ПолучитьРежимЗаписиДокумента()));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРежимЗаписиДокумента()
	
	РежимЗаписи = Неопределено;
	
	// Проводим во всех статусах для контроля лимитов 
	Если Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен 
		или Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.БюджетныйКонтроль
		или Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДК
		или Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеЦФО 
		или Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДФМ  
		или Объект.Статус = Перечисления.абс_СтатусыРекласификацииБюджета.СогласованиеДЭИ Тогда
	
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
	Иначе 		
		Если Объект.Ссылка.Проведен Тогда  			
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе 			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли; 		
	КонецЕсли;
		
	Возврат РежимЗаписи;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСписокДоступныхСтатусов();
	
	УстановитьРежимПросмотраДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ПричинаИзмененияСтатуса = "";
	Если СпрашиватьПричинуИзмененияСтатуса() Тогда
		ВвестиСтроку(Объект.ПричинаИзмененияСтатуса, "Введите причину изменения статуса",,Истина);
		
		// АБС ВСТАВКА Вводим номера телефонов 
		абс_БизнесПроцессыКлиент.ВвестиВнутреннийНомерТелефона(ПолучитьДанныеПользователя());
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПользователя() 
	
	СтруктураПользователя = Новый Структура("Пользователь, ВнутреннийНомер");
	
	СтруктураПользователя.Пользователь 		= глЗначениеПеременной("глТекущийПользователь");
	СтруктураПользователя.ВнутреннийНомер 	= СтруктураПользователя.Пользователь.абс_ВнутреннийНомер;
	
	Возврат СтруктураПользователя;
	
КонецФункции

&НаСервере
Функция СпрашиватьПричинуИзмененияСтатуса()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Возврат НЕ Объект.Статус = Объект.Ссылка.Статус;
	
КонецФункции

&НаСервере
Процедура РассчитатьСуммы(Сумма)
	
	СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Если СтруктураКурса.Кратность = 0 Тогда
		Объект.СуммаВал = Объект.Сумма;
	Иначе
		Объект.СуммаВал = Объект.Сумма*СтруктураКурса.Курс/СтруктураКурса.Кратность;
	КонецЕсли;
	
	Объект.СуммаЛимита = Объект.Сумма;
	Объект.СуммаЛимитаВал = Объект.СуммаВал;
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РассчитатьСуммы(Объект.Сумма);

КонецПроцедуры
